app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@school_class = SchoolClass.find(params[:id])

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "troy"], ["room_number", 202], ["created_at", "2020-12-15 01:12:40.064701"], ["updated_at", "2020-12-15 01:12:40.064701"]]
---
	def create
	  @school_class = SchoolClass.new
	  @school_class.title = params[:school_class][:title]
	  @school_class.room_number = params[:school_class][:room_number]
	  @school_class.save